[
    {
        "id": 310,
        "symbol": "C",
        "level": 2,
        "classTitle": "CHEMISTRY\nMETALLURGY",
        "notesAndWarnings": "In section\nC\n, the definitions of groups of chemical elements are as follows:\nALKALI METALS: Li, Na, K, Rb, Cs, Fr\nALKALINE EARTH METALS: Ca, Sr, Ba, Ra\nLANTHANIDES: elements with atomic numbers 57 to 71 inclusive\nRARE EARTHS: Sc, Y, Lanthanides\nACTINIDES: elements with atomic numbers 89 to 103 inclusive\nREFRACTORY METALS: Ti, V, Cr, Zr, Nb, Mo, Hf, Ta, W\nHALOGENS: F, Cl, Br, I, At\nNOBLE GASES: He, Ne, Ar, Kr, Xe, Rn\nPLATINUM GROUP: Os, Ir, Pt, Ru, Rh, Pd\nNOBLE METALS: Ag, Au, Platinum group\nLIGHT METALS: alkali metals, alkaline earth metals, Be, Al, Mg\nHEAVY METALS: metals other than light metals\nIRON GROUP: Fe, Co, Ni\nNON-METALS: H, B, C, Si, N, P, O, S, Se, Te, noble gases, halogens\nMETALS: elements other than non-metals\nTRANSITION ELEMENTS: elements with atomic numbers 21 to 30 inclusive, 39 to 48 inclusive, 57 to 80 inclusive, 89 upwards\nThe following notes are meant to assist in the use of this part of the classification scheme; they must not be read as modifying in any way the elaborations.\nSection\nC\ncovers:\npure chemistry, which covers inorganic compounds, organic compounds, macromolecular compounds, and their methods of preparation;\napplied chemistry, which covers compositions containing the above compounds, such as: glass, ceramics, fertilisers, plastics compositions, paints, products of the petroleum industry. It also covers certain compositions on account of their having particular properties rendering them suitable for certain purposes, as in the case of explosives, dyestuffs, adhesives, lubricants, and detergents;\ncertain marginal industries, such as the manufacture of coke and of solid or gaseous fuels, the production and refining of oils, fats, and waxes, the fermentation industry, (e.g. brewing and wine-making) the sugar industry;\ncertain operations or treatments, which are either purely mechanical, e.g. the mechanical treatment of leather and skins, or partly mechanical, e.g. the treatment of water, or the prevention of corrosion in general;\nmetallurgy, ferrous or non-ferrous alloys.\nIn the case of operations, treatments, products, or articles which have both a chemical and non-chemical part or aspect, the general rule is that the chemical part or aspect is covered by section\nC\n.\nIn some of these cases, the chemical part or aspect brings with it a non-chemical one, even though purely mechanical, because this latter aspect either is essential to the operation or treatment or constitutes an important element of it; it has seemed, in fact, more logical not to dissociate the different parts or aspects of a coherent whole. This is the case for applied chemistry and for the industries, operations, and treatments mentioned in Notes 1), c), d) and e). For example, furnaces peculiar to the manufacture of glass are covered by class\nC03\nand not by class\nF27\n.\nThere are, however, some exceptions in which the mechanical (or non-chemical) aspect carries with it the chemical aspect, for example:\ncertain extractive processes in subclass\nA61K\n;\nthe chemical purification of air in subclass\nA61L\n;\nchemical methods of fire-fighting in subclass\nA62D\n;\nchemical processes and apparatus in class\nB01\n;\nimnpregnation of wood in subclass\nB27K\n;\nchemical methods of analysis or testing in subclass\nG01N\n;\nphotographic materials and processes in class\nG03\n, and generally, the chemical treatment of textiles and the production of cellulose or paper in section\nD\n.\nIn still other cases, the pure chemical aspect is covered by section\nC\nand the applied chemical aspect by another section such as\nA\n,\nB\n,\nF\n, e.g. the use of a substance or composition for\ntreatment of plants or animals covered by subclass\nA01N\n;\nfoodstuffs covered by class\nA23\n;\nmunitions or explosives covered by class\nF42\n.\nWhen the chemical and mechanical aspects are so closely interlocked that a neat and simple division is not possible, or when certain mechanical processes follow as a natural or logical continuation of a chemical treatment, section\nC\nmay cover, in addition to the chemical aspect, a part only of the mechanical aspect, e.g. after-treatments of artificial stone covered by class\nC04\n. In this latter case a note or a reference is usually given to make the position clear, even if sometimes the division is rather arbitrary."
    },
    {
        "id": 336,
        "symbol": "C07",
        "level": 4,
        "classTitle": "ORGANIC CHEMISTRY\nsuch compounds as the oxides, sulfides, or oxysulfides of carbon, cyanogen, phosgene, hydrocyanic acid or salts thereof\nC01\n; products obtained from layered base-exchange silicates by ion-exchange with organic compounds such as ammonium, phosphonium or sulfonium compounds or by intercalation of organic compounds\nC01B33/44\n; macromolecular compounds\nC08\n; dyes\nC09\n; fermentation products\nC12\n; fermentation or enzyme-using processes to synthesise a desired chemical compound or composition or to separate optical isomers from a racemic mixture\nC12P\n; production of organic compounds by electrolysis or electrophoresis\nC25B3/00\n,\nC25B7/00",
        "notesAndWarnings": "In this class, the following term is used with the meaning indicated:\n\"preparation\" covers purification, separation, stabilisation or use of additives, unless a separate place is provided therefor.\nThis IPC Note does not apply in CPC.\nIn subclasses\nC07C\n-\nC07K\n, the last place priority rule is applied, i.e. at each hierarchical level, in the absence of an indication to the contrary, and with the exception referred to below, a compound is classified in the last appropriate place. For example, 2-butyl-pyridine, which contains an acyclic chain and a heterocyclic ring, is classified only as a heterocyclic compound, in subclass\nC07D\n. In general, and in the absence of an indication to the contrary, the terms \"acyclic\" and “aliphatic” are used to describe compounds in which there is no ring; and, if a ring were present, the compound would be taken by the \"last place\" rule to a later group for cycloaliphatic or aromatic compounds, if such a group exists. Where a compound or an entire group of compounds exists in tautomeric forms, it is classified as though existing in the form which is classified last in the system, unless the other form is specifically mentioned earlier in the system.\nChemical compounds and their preparation are classified in the groups for the type of compound prepared. The processes of preparation are also classified in the groups for the types of reaction employed, if of interest. Examples of such places outside this class are:\nC12P\nFermentation or enzyme-using processes to synthesise a desired chemical compound or composition or to separate optical isomers from a racemic mixture\nC25B3/00\nElectrolytic production of organic compounds\nC25B7/00\nElectrophoretic production of compounds\nGeneral processes for the preparation of a class of compounds falling into more than one main group are classified in the groups for the processes employed, when such groups exist. The compounds prepared are also classified in the groups for the types of compound prepared, if of interest.\nIn this class, in the absence of an indication to the contrary, the compounds containing carboxyl or thiocarboxyl groups are classified as the relevant carboxylic or thiocarboxylic acids, unless the \"last place rule\" (see Note (3), above) dictates otherwise; a carboxyl group being a carbon atom having three bonds, and no more than three, to hetero atoms, other than nitrogen atoms of nitro or nitroso groups, with at least one multiple bond to the same hetero atom and a thiocarboxyl group being a carboxyl group having at least one bond to a sulfur atom, e.g. amides or nitriles of carboxylic acids, are classified with the corresponding acids\nunless the \"last place rule\" (see Note (3), above) dictates otherwise\n.\nAnhydrides and halides of carboxylic acids are classified as the relevant acids unless otherwise indicated.\nSalts of a compound, unless specifically provided for, are classified as that compound, e.g. aniline hydrochloride is classified as containing carbon, hydrogen and nitrogen only (in\nC07C211/46\n), sodium malonate is classified as malonic acid (in\nC07C55/08\n), and a mercaptide is classified as the mercaptan. Metal chelates are dealt with in the same way. Similarly, metal alcoholates and metal phenates are\ngenerally\nclassified in subclass\nC07C\nand not in subclass\nC07F\n, the alcoholates\nfor instance\nin groups\nC07C31/28\n - \nC07C31/32\nand the phenates as the corresponding phenols in group\nC07C39/235\nor\nC07C39/44\n. Salts, adducts or complexes formed between two or more organic compounds are classified according to all compounds forming the salts, adducts or complexes."
    },
    {
        "id": 344,
        "symbol": "C07K",
        "level": 5,
        "classTitle": "PEPTIDES\npeptides in foodstuffs\nA23\n; obtaining protein compositions for foodstuffs, working-up proteins for foodstuffs\nA23J\n; preparations for medicinal purposes\nA61K\n; peptides containing beta-lactam rings\nC07D\n; cyclic dipeptides not having in their molecule any other peptide link than those which form their ring, e.g. piperazine-2,5-diones,\nC07D\n; ergot alkaloids of the cyclic peptide type\nC07D519/02\n; macromolecular compounds having statistically distributed amino acid units in their molecules, i.e. when the preparation does not provide for a specific; but for a random sequence of the amino acid units, homopolyamides and block copolyamides derived from amino acids\nC08G69/00\n; macromolecular products derived from proteins\nC08H1/00\n; preparation of glue or gelatine\nC09H\n; single cell proteins, enzymes\nC12N\n; genetic engineering processes for obtaining peptides\nC12N15/00\n; compositions for measuring or testing processes involving enzymes\nC12Q\n; investigation or analysis of biological material\nG01N33/00",
        "notesAndWarnings": "In this subclass, the following terms or expressions are used with the meanings indicated:\n\"amino acids\" are compounds in which at least one amino group and at least one carboxyl group are bound to the same carbon skeleton and the nitrogen atom of the amino group may form part of a ring;\n\"normal peptide link\" is one between an alpha-amino group of an amino acid and the carboxyl group - in position 1 - of another alpha-amino acid;\n\"abnormal peptide link\" is a link where at least one of the linked amino acids is not an alpha-amino acid or a link formed by at least one carboxyl or amino group being part of the side chain of a alpha-amino acid;\n\"peptides\" are compounds containing at least two amino acid units, which are bound through at least one normal peptide link, including oligopeptides, polypeptides and proteins, where:\n\"linear peptides\" may comprise rings formed through S-S bridges, or through a hydroxy or a mercapto group of an hydroxy- or mercapto-amino acid and the carboxyl group of another amino acid, (e.g. peptide lactones) but do not comprise rings which are formed only through peptide links;\n\"cyclic peptides\" are peptides comprising at least one ring formed only through peptide links; the cyclisation may occur only through normal peptide links or through abnormal peptide links, e.g. through the 4-amino group of 2,4-diamino-butanoic acid. Thus, cyclic compounds in which at least one link in the ring is a non-peptide link are considered as \"linear peptides\";\n\"depsipeptides\" are compounds containing a sequence of at least two alpha-amino acids and at least one alpha-hydroxy carboxylic acid, which are bound through at least one normal peptide link and ester links, derived from the hydroxy carboxylic acids, where:\n\"linear depsipeptides\" may comprise rings formed through S-S bridges, or through an hydroxy or a mercapto group of an hydroxy- or mercapto-amino acid and the carboxyl group of another amino- of hydroxy-acid but do not comprise rings formed only through peptide or ester links derived from hydroxy carboxylic acids, e.g. Gly-Ala-Gly-OCH\n2\nCO\n2\nH and Gly-OCH\n2\nCO-Ala-Gly are considered as \"linear depsipeptides\", but HOCH\n2\nCO-Gly-Ala-Gly does not contain an ester link, and is thus a derivative of Gly-Ala-Gly which is covered by\nC07K5/08\n;\n\"cyclic depsipeptides\" are peptides containing at least one ring formed only through peptide or ester links - derived from hydroxy carboxylic acids -, e.g. Gly-Ala-Gly-OCH\n2\nCO.\nFragments of peptides or peptides modified by removal or addition of amino acids, by substitution of amino acids by others, or by combination of these modifications, are classified as the parent peptides. However, fragments of peptides having only four or less amino acids are also classified in group\nC07K5/00\n.\nPeptides prepared by chemical processes and having an amino acid sequence derived from naturally occurring peptides are classified with the natural one.\nPeptides prepared by recombinant DNA technology are not classified according to the host, but according to the original peptide expressed, e.g. HIV peptide expressed in E. coli is classified with HIV peptides.\nWhen classifying in this subclass, classification is also made in group\nB01D15/08\ninsofar as subject matter of general interest relating to chromatography is concerned.\nThe following IPC groups are not used in the CPC scheme. Subject matter covered by these groups is classified in the following CPC groups:\nC07K5/023\ncovered by\nC07K5/0202\nC07K5/027\ncovered by\nC07K5/0205\nC07K5/03\ncovered by\nC07K5/0207\nC07K5/033\ncovered by\nC07K5/021\nC07K5/037\ncovered by\nC07K5/0215\nC07K5/062\ncovered by\nC07K5/06017\nC07K5/065\ncovered by\nC07K5/06078\nC07K5/068\ncovered by\nC07K5/06086\nC07K5/072\ncovered by\nC07K5/06104\nC07K5/075\ncovered by\nC07K5/0613\nC07K5/078\ncovered by\nC07K5/06139\nC07K5/083\ncovered by\nC07K5/0804\nC07K5/087\ncovered by\nC07K5/0812\nC07K5/09\ncovered by\nC07K5/0815\nC07K5/093\ncovered by\nC07K5/0819\nC07K5/097\ncovered by\nC07K5/0821\nC07K5/103\ncovered by\nC07K5/1005\nC07K5/107\ncovered by\nC07K5/1016\nC07K5/11\ncovered by\nC07K5/1019\nC07K5/113\ncovered by\nC07K5/1021\nC07K5/117\ncovered by\nC07K5/1024\nC07K14/185\ncovered by\nC07K14/1816\nC07K14/725\ncovered by\nC07K14/705\nC07K14/73\ncovered by\nC07K14/70514\nC07K14/735\ncovered by\nC07K14/70535\nC07K14/74\ncovered by\nC07K14/70539"
    },
    {
        "id": 98717,
        "symbol": "C07K16/00",
        "level": 7,
        "classTitle": "Immunoglobulins [IGs], e.g. monoclonal or polyclonal antibodies\nantibodies with enzymatic activity, e.g. abzymes\nC12N9/0002",
        "notesAndWarnings": "Documents characterised by the technical aspects of the construction of an antibody or fragment thereof, should be classified in\nC07K16/00\n - \nC07K16/065\nor\nC07K16/46\n - \nC07K16/468\nDocuments not characterised by the technical aspects of the construction of an antibody or fragment thereof, should be classified only according to their specificity, where necessary accompanied by one or more appropriate indexing codes"
    }
]
